#ETL (Extract, Transform, Load) *Process*

##Load the CSV file (using Python).

In [2]:
# Load the Pandas libraries with alias 'pd' 
import numpy as np
import pandas as pd
# Read data from file
url = 'https://drive.google.com/file/d/1B0EUA2Y76IqtmPeY6HwVEmaWucw81Ndq/view?usp=sharing'
path = 'https://drive.google.com/uc?export=download&id='+url.split('/')[-2]
df = pd.read_csv(path)
###Top 
df.head()

         Date  Station Area   Description  ...        AH       MAV        CD
0  01/01/2013   Rathfarnham     S/S OTHER  ...  02:28:54  02:48:54  03:08:54
1  01/01/2013      Tallaght      Fire CAR  ...  02:25:43  02:45:43  03:05:43
2  01/01/2013  North Strand       S/S RTA  ...  04:11:20  04:31:20  04:51:20
3  01/01/2013      Tallaght      Fire CAR  ...  04:50:48  05:10:48  05:30:48
4  01/01/2013       Finglas  Fire DOM PER  ...  04:50:47  05:10:47  05:30:47

[5 rows x 11 columns]

##Output the total number of rows and columns.

In [3]:
##Count of Columns and Rows
No_of_col = df.shape[1]
No_of_rows = df.shape[0]
print(f"Total Number of Columns in the Dataset is {No_of_col}")
print(f"Total Number of Rows in the Dataset is {No_of_rows:,}")

Total Number of Columns in the Dataset is 11
Total Number of Rows in the Dataset is 38,556

##Output the number of non-null rows (by column).

In [4]:
##Count of Not null columns
Non_Null_columns = df.count()
print("Total Number of Non Null Values by Columns in the Dataset")
print(Non_Null_columns)

Total Number of Non Null Values by Columns in the Dataset
Date            38556
Station Area    38556
Description     38556
TOC             38556
ORD             38556
MOB             37311
IA              30962
LS              38556
AH                153
MAV             38530
CD              38530
dtype: int64

##Output the number of null values (by column)

In [5]:
##Output the number of null values (by column)
Null_Columns = df.isnull().sum()
print("Total Number of Null Values by Columns in the Dataset")
print(Null_Columns)

Total Number of Null Values by Columns in the Dataset
Date                0
Station Area        0
Description         0
TOC                 0
ORD                 0
MOB              1245
IA               7594
LS                  0
AH              38403
MAV                26
CD                 26
dtype: int64

##Output the number of null values for all columns

In [6]:
#Count of Null columns
Total_Null_col = df.isnull().sum().sum()
print(f"Total Number of Null Values in the Dataset : {Total_Null_col:,}")

Total Number of Null Values in the Dataset : 47,294

##Output the total number of call outs by Station Area

In [7]:
 df.groupby('Station Area').Date.agg(['count'])

                count
Station Area
Balbriggan        688
Blanchardstown   2089
Dolphins Barn    4018
Donnybrook       1787
Dun Laoghaire    3271
Dunshaughlin        2
Finglas          3030
Kilbarrack       3548
MH14                1
North Strand     1645
Phibsborough     3160
Rathfarnham      2129
Skerries          449
Swords           2614
Tallaght         6525
Tara St          3600

##Output the total number of call outs by Station Area and Date.

In [9]:
df.groupby(['Station Area','Date']).TOC.agg(['count'])

                         count
Station Area Date
Balbriggan   01/01/2013      3
             01/01/2014      1
             01/02/2014      2
             01/03/2013      1
             01/03/2014      1
...                        ...
Tara St      31/10/2013      9
             31/10/2014     11
             31/10/2015      5
             31/12/2013      4
             31/12/2014      3

[12483 rows x 1 columns]

##Output the total number of call outs by Station Area and Date where the description is either Fire Car or Fire Alarm.

In [10]:
df[(df.Description == 'Fire CAR') | (df.Description == 'Fire ALARM')].groupby(['Station Area','Date']).TOC.agg(['count'])

                         count
Station Area Date
Balbriggan   01/01/2013      3
             01/01/2014      1
             01/04/2013      1
             01/05/2013      1
             01/11/2015      1
...                        ...
Tara St      31/07/2015      2
             31/08/2013      1
             31/10/2014      2
             31/10/2015      2
             31/12/2013      1

[6792 rows x 1 columns]

##Replace any instance of “,” (in any column) with an empty string.

In [11]:
#Checking if the Value "," exists in the Dataset
exists = ',' in df.values
print(exists)

True

In [12]:
#Replacing the "," with an empty String
df = df.replace(',','')

In [13]:
#Confirming the Replacement Worked
exists = ',' in df.values
print(exists)

False

##Replace any instance of “-” (in any column) with an empty string.

In [14]:
#Checking if the Value "-" exists in the Dataset
exists = '-' in df.values
print(exists)

True

In [15]:
#Replacing the "-" with an empty String
df = df.replace('-','')

In [16]:
#Confirming the Replacement Worked
exists = '-' in df.values
print(exists)

False

##Drop rows for the columns (AH, MAV, CD) where at least one row value is NULL

In [17]:
#Drop Na Values as seen above
#Null Values for the columns are AH = 38,403 MAV = 26 CD = 26
No_of_rows = df.shape[0]
print(f"Total Number of Rows in the Dataset before Null rows are removed are removed {No_of_rows:,}")

df = df.dropna(subset=['AH', 'MAV','CD'])

print("Null Rows Removed")

No_of_rows = df.shape[0]
print(f"Total Number of Rows in the Dataset After Null rows are removed {No_of_rows}")

Total Number of Rows in the Dataset before Null rows are removed are removed 38,556
Null Rows Removed
Total Number of Rows in the Dataset After Null rows are removed 153

##Drop any duplicate rows (except for the first occurrence).

In [18]:
#Column Count After removing Nulls
##Count of Rows
No_of_rows = df.shape[0]
print(f"Total Number of Rows in the Dataset before Duplicates are removed {No_of_rows}")

df = df.drop_duplicates(keep='first')
print("Duplcates removed")
No_of_rows = df.shape[0]
print(f"Total Number of Rows in the Dataset After Duplicates are removed {No_of_rows}")

Total Number of Rows in the Dataset before Duplicates are removed 153
Duplcates removed
Total Number of Rows in the Dataset After Duplicates are removed 152

##Output the minimum time difference between TOC and ORD.

In [19]:
## Convert TOC and ORD to datetime to aid difference in time
df['TOC'] = pd.to_datetime(df['Date'] + ' ' + df['TOC'])
df['ORD'] = pd.to_datetime(df['Date'] + ' ' + df['ORD'])
##Add new Column that shows the time difference between TOC and ORD
df["Diff_ORD_TOC"] = (df['ORD'] -df['TOC'])

##Get the Minimum time difference
Min_TOC_ORD = min(df["Diff_ORD_TOC"]).seconds
print(f"The Minimum time diffrence between time the call is received in the control centre and time the vehicle is mobilised to the incident by a control operator is : {Min_TOC_ORD} seconds")

The Minimum time diffrence between time the call is received in the control centre and time the vehicle is mobilised to the incident by a control operator is : 30 seconds

##Export

In [20]:
#Preparing the columns for upload into an SQL database
df['MOB'] = pd.to_datetime(df['Date'] + ' ' + df['MOB'])
df['IA'] = pd.to_datetime(df['Date'] + ' ' + df['IA'])
df['LS'] = pd.to_datetime(df['Date'] + ' ' + df['LS'])
df['AH'] = pd.to_datetime(df['Date'] + ' ' + df['AH'])
df['MAV'] = pd.to_datetime(df['Date'] + ' ' + df['MAV'])
df['CD'] = pd.to_datetime(df['Date'] + ' ' + df['CD'])
df['Date'] = pd.to_datetime(df['Date'])
df=df.rename(columns = {'Station Area':'Station_Area'})
df.head()

        Date  Station_Area  ...                  CD    Diff_ORD_TOC
0 2013-01-01   Rathfarnham  ... 2013-01-01 03:08:54 0 days 00:01:39
1 2013-01-01      Tallaght  ... 2013-01-01 03:05:43 0 days 00:00:43
2 2013-01-01  North Strand  ... 2013-01-01 04:51:20 0 days 00:00:50
3 2013-01-01      Tallaght  ... 2013-01-01 05:30:48 0 days 00:01:05
4 2013-01-01       Finglas  ... 2013-01-01 05:30:47 0 days 00:01:12

[5 rows x 12 columns]

In [21]:
  import sqlite3 as dd
  ##Creating/Connecting to a database
  db = dd.connect("FIreAndCallouts.db")
  db.execute("drop table if exists results")
  try:
    ###Creating table on database created with column names
    db.execute("create table FireAndCalloutsData(Date date, Station_Area text,Description text,TOC date,ORD date,MOB date,IA date, LS date,AH date,MAV date,CD date)")
  except:
    print("Already table existed !!")

In [22]:
for index, row in df.iterrows():
  cmd = "insert into FireAndCalloutsData(Date, Station_Area,Description,TOC,ORD,MOB,IA,LS,AH,MAV,CD) values('{}','{}','{}','{}','{}','{}','{}','{}','{}','{}','{}')".format(row.Date, row.Station_Area, row.Description,row.TOC,row.ORD,row.MOB,row.IA,row.LS,row.AH,row.MAV,row.CD)
  ###Check to confirm if the number exists and condition to follow if possible
  db.execute(cmd)
db.commit()
print("Record Sucessfully Added")

Record Sucessfully Added

In [23]:
cmd = "Select * from FireAndCalloutsData"
Database_Data = pd.read_sql_query(cmd, db)
Database_Data.head()

                  Date  Station_Area  ...                  MAV                   CD
0  2013-01-01 00:00:00   Rathfarnham  ...  2013-01-01 02:48:54  2013-01-01 03:08:54
1  2013-01-01 00:00:00      Tallaght  ...  2013-01-01 02:45:43  2013-01-01 03:05:43
2  2013-01-01 00:00:00  North Strand  ...  2013-01-01 04:31:20  2013-01-01 04:51:20
3  2013-01-01 00:00:00      Tallaght  ...  2013-01-01 05:10:48  2013-01-01 05:30:48
4  2013-01-01 00:00:00       Finglas  ...  2013-01-01 05:10:47  2013-01-01 05:30:47

[5 rows x 11 columns]